#SC CODER BY SAMIR
#BANGLADESH BIG PROGRAMMER SNIGDHO
import time
import requests
import bs4
import json
import os
import sys
import random
import datetime
import time
import re
from bs4 import BeautifulSoup as irfan
land = '23860'
hars = '703036'

def irfanx(z):
    for e in z + '\n':
        sys.stdout.write(e)
        sys.stdout.flush()
        time.sleep(0.0008)

os.system('clear')
print(f""" 
\033[1;33m ######    \033[1;91m ###   \033[1;32m ##     ##\033[1;34m ####\x1b[1;95m ########
\033[1;33m##    ##  \033[1;91m ## ##  \033[1;32m ###   ### \033[1;34m ## \x1b[1;95m ##     ##
\033[1;33m##       \033[1;91m ##   ## \033[1;32m #### #### \033[1;34m ## \x1b[1;95m ##     ##
\033[1;33m ###### \033[1;91m ##     ##\033[1;32m ## ### ## \033[1;34m ## \x1b[1;95m ########
\033[1;33m      ##\033[1;91m #########\033[1;32m ##     ## \033[1;34m ## \x1b[1;95m ##   ##
\033[1;33m##    ##\033[1;91m ##     ##\033[1;32m ##     ## \033[1;34m ## \x1b[1;95m ##    ##
\033[1;33m ###### \033[1;91m ##     ##\033[1;32m ##     ##\033[1;34m #### \x1b[1;95m##     ##


\x1b[1;96m┏─══─━══─══━─══─| ✠ |─══━─══─══━─══─┓
\x1b[38;5;46m┃AUTHOR    ; SADMAN SAMIR SNIGDHO   ┃
\x1b[1;93m┃WHATSAPP  ; +8801871778635         ┃
\x1b[1;95m┃FACEBOOK  ; SNIGDHO AFRIDI         ┃
\x1b[1;91m┃GITHUB    ; SAMIR-CYBER-143        ┃
\x1b[1;96m┗─══─━════─━─══─| ✠ |─══━─══─══━─══─┛

\x1b[1;93m
❦ ════════════════════ •⊰❂⊱• ════════════════════ ❦
┃ 𝐓𝐎𝐎𝐋𝐒 ➣➣➣    𝐀𝐔𝐓𝐎 𝐔𝐍𝐋𝐈𝐌𝐈𝐓𝐄𝐃 𝐂𝐎𝐎𝐊𝐈𝐄 𝐓𝐎𝐎𝐋𝐒        ┃
❦ ════════════════════ •⊰❂⊱• ════════════════════ ❦

\033[1;32m
╔════════════════════ °❀•°✮°•❀°════════════════════╗
╽          𝐀𝐔𝐓𝐎 𝐂𝐎𝐎𝐊𝐈𝐄 𝐒𝐂 𝐅𝐔𝐋𝐋 𝐌𝐀𝐊𝐄 𝐒𝐍𝐈𝐆𝐃𝐇𝐎        ╽
╚════════════════════ °❀•°✮°•❀°════════════════════╝""")
print(' \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
print('       \033[38;5;195mSUBSCRIBE BY YOUTUBE CHANNEL PLZ')
print(' \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
x = input('                  \033[38;5;46m Type Enter')
os.system('xdg-open https://youtube.com/@samircyber143')
time.sleep(0.7)
print(' \033[38;5;45m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
print('                    \033[38;5;196m! \033[38;5;192mNOTE \033[38;5;196m!                \n                \033[38;5;46mAssalamu Alaikum \n  \033[38;5;192mTHIS COMMAND CREATE ONLY COOKIE CREATE \n OUR COMMAND COOKIES 70% WORKING COOKIES\n   DO NOT TAKE COOKIES OTHER PERPOSE PLZ\n\x1b[1;92m THIS COOKIES COMMAND ONLY MAKE BY FILE CREATE OR DUMP')
print(' \033[38;5;45m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
x = input('               \033[38;5;46m Press The Enter')

print(' \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
x = input(' \033[38;5;196m[\033[38;5;195m1\033[38;5;196m]\033[38;5;46m Auto Cookie \033[38;5;196m[\033[38;5;195mV1\033[38;5;196m] \n \033[38;5;196m[\033[38;5;195m2\033[38;5;196m]\033[38;5;46m Auto Cookie \033[38;5;196m[\033[38;5;195mV2\033[38;5;196m] \n \033[38;5;196m[\033[38;5;195m3\033[38;5;196m]\033[38;5;46m Auto Cookie \033[38;5;196m[\033[38;5;195mV3\033[38;5;196m] \n \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━ \n \033[38;5;196m[\033[38;5;195m•\033[38;5;196m]\033[38;5;45m Choose : ')
print(' \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━')
ses = requests.Session()
url = irfan(ses.get(f'''https://www.facebook.com/100032386028880/posts/pfbid028x4o9HTdDJfPXKiH52a9aXJjz8iz8oXMSKRL1io3X2A5vhVDKdYmx4ofBrDTMWEsl/?app=fbl''').text, 'html.parser')
data = re.findall('"text":"(.*?)"', str(url))
n = 0
for O in data:
    time.sleep(1)
    n += 1
ses = requests.Session()
url = irfan(ses.get(f'''https://www.facebook.com/103400442502880/posts/pfbid0P9xr9u7CVLBZyoYKNF7qicivUchGDzfceL5SamHx7LWTaGQFBnqRoQW5xrAHzAHRl/?app=fbl''').text, 'html.parser')
data = re.findall('"text":"(.*?)"', str(url))
n = 0
for O in data:
    time.sleep(1)
    n += 2
ses = requests.Session()
url = irfan(ses.get(f'''https://www.facebook.com/100068286986970/posts/pfbid027j6VRFYqqSXtrPqtLJbfpVsPfxP69gNbA1Pg3yCmnfDg9EJ9NosZSgNJfYCMvWEFl/?app=fbl''').text, 'html.parser')
data = re.findall('"text":"(.*?)"', str(url))
n = 0
for O in data:
    time.sleep(1)
    n += 3
    irfanx(f'''\x1b[1;91m \033[38;5;196m[\033[38;5;195m{n}\033[38;5;196m] \033[38;5;196m[\033[38;5;45mSAMIR_COOKIES✰\033[38;5;196m] \033[38;5;195m: \033[38;5;46m''' + O)
    print()
    x = input(' \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━ \n \033[1;91m<===>\033[1;41m\033[1;97m FIRST COPY COOKIE THAN TRY  \033[;0m\033[1;91m<===>\033[1;92m\n \033[1;93m━─━────━─━━─━────────༺༻━─━────━─━────────━─━\n \033[38;5;196m[\033[38;5;45m•\033[38;5;196m]\033[38;5;45m Choose : \033[38;5;46m')
    print()
